Map<String, dynamic> semesterevaluation = {
  'finalValue': 80.0,
  'semesterResult': " نتيجة الفصل الاول",
  'ResidualResult': " النتجية التي لم تحصل عليها",
  'programName': [
    "اللغة الانجليزية",
    "حاسوب",
    "التربية و السلوك",
    "القران و العلوم الشرعية",
    "البرامج و الانشطة"
  ],
  'programValue': [80.0, 90.0, 70.0, 89.0, 100.0],
};
Map<String, dynamic> semesterevaluation1 = {
  'finalValue': 80.0,
  'semesterResult': " نتيجة الفصل الثاني",
  'ResidualResult': " النتجية التي لم تحصل عليها",
  'programName': [
    "اللغة الانجليزية",
    "حاسوب",
    "التربية و السلوك",
    "القران و العلوم الشرعية",
    "البرامج و الانشطة"
  ],
  'programValue': [80.0, 90.0, 70.0, 89.0, 100.0],
};

List<Map<String, String>> datanotification = [
  {
    "date": "2024-01-01",
    "title": "برنامج التغذية الصحية",
    "subtitle":
        "يتضمن تقديم وجبات غذائية متوازنة تحتوي على جميع العناصر الغذائية الأساسية."
  },
  {
    "date": "2024-02-15",
    "title": "برنامج السكن الجامعي",
    "subtitle": "يوفر سكنًا مريحًا وآمنًا للطلاب مع جميع المرافق الأساسية."
  },
  {
    "date": "2024-03-10",
    "title": "برنامج تطوير المهارات",
    "subtitle":
        "يهدف إلى تحسين المهارات الشخصية والمهنية للطلاب من خلال ورش عمل ودورات تدريبية."
  },
  {
    "date": "2024-04-22",
    "title": "برنامج الإقامة العائلية",
    "subtitle":
        "يوفر فرصًا للطلاب للإقامة مع عائلات محلية لتعزيز التبادل الثقافي."
  },
  {
    "date": "2024-05-05",
    "title": "برنامج القيادة الشابة",
    "subtitle":
        "يهدف إلى تطوير مهارات القيادة لدى الشباب من خلال الأنشطة العملية والتدريبات."
  },
  {
    "date": "2024-06-18",
    "title": "برنامج التغذية الرياضية",
    "subtitle": "يوفر خطط وجبات مخصصة للرياضيين لتحسين الأداء البدني."
  },
  {
    "date": "2024-07-22",
    "title": "برنامج التغذية الرياضية",
    "subtitle":
        "يوفر خطط وجبات مخصصة للرياضيين لتحسين الأداء البدنيوفر خطط وجبات مخصصة للرياضيين لتحسين الأداء البدنيوفر خطط وجبات مخصصة للرياضيين لتحسين الأداء البدنيوفر خطط وجبات مخصصة للرياضيين لتحسين الأداء البدني."
  },
  {
    "date": "2024-08-30",
    "title": "برنامج التبادل الطلابي",
    "subtitle": "يسمح للطلاب بالدراسة في بلدان أخرى واكتساب تجارب ثقافية جديدة."
  },
];

List<String> classes = ["التاسع", "اول ثانوي", "ثاني ثانوي", "ثالث ثانوي"];
List<String> schools = ["الفقيد بن حميده", "الابداع", "سيف بن ذي يزن"];
